artillery/get-many.yml
config:
  target: 'http://localhost:3000'
  payload:
    path: "get-many.csv"
    fields:
      - "name"
      - "description"
      - "user"
      - "isProfile"
  phases:
    - duration: 180
      arrivalRate: 10
      rampTo: 100
      name: "Warm up phase"
    - pause: 60
      name: "Pause phase"
    - duration: 600
      arrivalRate: 100
      name: "Sustained max load phase"
  ensure:
    p99: 10
scenarios:
  - flow:
    - get:
        url: "/api/channel/many?name={{ name }}&description={{ description }}&user={{ user }}&isProfile={{ isProfile }}"